ACLAB-HCMUT/Thesis_Integrate_UWB_For_Lab/STM32_Firmware/SDK/Project/ds_twr_init/main.c
}

/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
//   /*!< At this stage the microcontroller clock setting is already configured,
//        this is done through SystemInit() function which is called from startup
//        file (startup_stm32f10x_xx.s) before to branch to application main.
//        To reconfigure the default setting of SystemInit() function, refer to
//        system_stm32f10x.c file
//      */

double final_distance =  0;

//=============================================================//
/**************************************************************/
/********More Information Please Visit Our Website*************/
/***********************bphero.com.cn**************************/
/**********************Version V1.1****************************/
/**************************************************************/
//=============================================================//
int main(void)
{
    uint8 anthor_index = 0;
    uint8 tag_index = 0;

    uint8 Semaphore_Enable = 0 ;
    uint8 Waiting_TAG_Release_Semaphore = 0;
    int8 frame_len = 0;
		//lable1:
    // Start with board specific hardware init. 
		peripherals_init();
	
    printf("hello dwm1000!\r\n");
	

    // Reset and initialise DW1000.
    // For initialisation, DW1000 clocks must be temporarily set to crystal speed. After initialisation SPI rate can be increased for optimum
    // performance. 

		reset_DW1000(); // Target specific drive of RSTn line into DW1000 low for a period. 
    spi_set_rate_low();

    if(dwt_initialise(DWT_LOADUCODE) == -1)
    {
        printf("dwm1000 init fail!\r\n");
        OLED_ShowString(0,0,"INIT FAIL");
        while (1)
        {
						//STM_EVAL_LEDOn(LED1);
						GPIO_SetBits(GPIOC,GPIO_Pin_13);
						deca_sleep(1000);
						//STM_EVAL_LEDOff(LED1);
						GPIO_ResetBits(GPIOC,GPIO_Pin_13);
						deca_sleep(1000);
        }
    }
    spi_set_rate_high();

    // Configure DW1000. See NOTE 6 below. 
    dwt_configure(&config);
    dwt_setleds(1);
		
		// User configure
		setup_DW1000ServerIRQ(1);
		
    // Apply default antenna delay value. See NOTE 1 below. 
    dwt_setrxantennadelay(RX_ANT_DLY);
    dwt_settxantennadelay(TX_ANT_DLY);
    OLED_ShowString(0,0,"INIT PASS");

    printf("init pass!\r\n");
		printf("AIT-BU01-DB V100 T2020-5-17\r\n");
		
		
    AnchorList[0].x =0.12;
    AnchorList[0].y =0.34;
    AnchorList[0].z =0;

    AnchorList[1].x =0.25;
    AnchorList[1].y =0;
    AnchorList[1].z =0;

    AnchorList[2].x =0;
    AnchorList[2].y =0;
    AnchorList[2].z =0;
    int rx_ant_delay =32880;
    int index = 0 ;
		
		extern UserSet UserSetNow;
		uint16_t buff[3]={1,0,0xff};//I???
		FLASH_ReadMoreData(USER_FLASH_BASE,buff,3);
		if(buff[0]==1)
		{
				UserSetNow.ANCHOR_TAG=1;
		}
		else if(buff[0]==0)
		{
				UserSetNow.ANCHOR_TAG=0;
		}
		else
		{
				UserSetNow.ANCHOR_TAG=1;
		}

//#ifdef ANTHOR

if(UserSetNow.ANCHOR_TAG==1)
{
		if(buff[1]>=0 && buff[1]<=255)
		{
				UserSetNow.ID=buff[1];
				ANCHOR_IND=UserSetNow.ID;
		}
		printf("device:anchor ID:%d\r\n",ANCHOR_IND);
	
		Anchor_Array_Init();
    // Loop forever initiating ranging exchanges. 
    OLED_ShowString(0,0,"DS TWR ANTHOR");
    //OLED_ShowString(0,2,"Distance:");

    //KalMan_PramInit();
		ANTHOR_MEASURE();
}

//#endif


//#ifdef TAG
/*
if(UserSetNow.ANCHOR_TAG==0)
{
	
		if(buff[1]>=0 && buff[1]<=255)
		{
				UserSetNow.ID=buff[1];
				TAG_ID=UserSetNow.ID;
				MASTER_TAG=TAG_ID;
		}
	
		printf("device:TAG ID:%d\r\n",UserSetNow.ID);
		if(TAG_ID == MASTER_TAG)
		{
        OLED_ShowString(0,0,"DS MASTER TAG:");
    }
    else
    {
        OLED_ShowString(0,0,"DS SLAVE TAG:");
    }
		
    // Set expected response's delay and timeout. See NOTE 4 and 5 below.
    // As this example only handles one incoming frame with always the same delay and timeout, those values can be set here once for all. 
    dwt_setrxaftertxdelay(POLL_TX_TO_RESP_RX_DLY_UUS);
    dwt_setrxtimeout(RESP_RX_TIMEOUT_UUS);
    

    //OLED_ShowString(0,2,"Distance:"); chnage by johhn

    if(TAG_ID ==  MASTER_TAG)
    {
        Semaphore_Enable = 1 ;
        Semaphore_Init();
        Waiting_TAG_Release_Semaphore = 0;
    }
    else
    {
        Semaphore_Enable = 0 ;
    }
    //Master TAG0
			
		TAG_MEASURE();
}		
//#endif
*/
if(UserSetNow.ANCHOR_TAG==0)
{
/* Set expected response's delay and timeout. See NOTE 4 and 5 below.
     * As this example only handles one incoming frame with always the same delay and timeout, those values can be set here once for all. */
    dwt_setrxaftertxdelay(POLL_TX_TO_RESP_RX_DLY_UUS);
    dwt_setrxtimeout(RESP_RX_TIMEOUT_UUS);
    if(TAG_ID == MASTER_TAG)
    {
        OLED_ShowString(0,0,"DS MASTER TAG:");

    }
    else
    {
        OLED_ShowString(0,0,"DS SLAVE TAG:");
    }

    OLED_ShowString(0,2,"Distance:");

    if(TAG_ID ==  MASTER_TAG)
    {
        Semaphore_Enable = 1 ;
        Waiting_TAG_Release_Semaphore = 0;
    }
    else
    {
        Semaphore_Enable = 0 ;
    }


    Semaphore_Init();
    //Master TAG0
    while(1)
    {
        if(Semaphore_Enable == 1)
        {
            //GPIO_ResetBits(GPIOA,GPIO_Pin_3);
              GPIO_ResetBits(GPIOA,GPIO_Pin_1);
              GPIO_ResetBits(GPIOA,GPIO_Pin_2);
            //send message to anthor,TAG<->ANTHOR
            //OLED_ShowString(0, 2,"Fail");
            
			//dwt_setrxaftertxdelay(POLL_TX_TO_RESP_RX_DLY_UUS);
			//dwt_setrxtimeout(RESP_RX_TIMEOUT_UUS);
            Tag_Measure_Dis();//measuer distance between tag and all anthor
             //OLED_ShowString(0, 2,"PASS");
            Semaphore_Enable = 0 ;

            if(TAG_ID != MASTER_TAG)
            {
                //send release semaphore to master tag
                Semaphore_Release[ALL_MSG_SN_IDX] = frame_seq_nb;
                Semaphore_Release[ALL_MSG_TAG_IDX] = TAG_ID;
                dwt_writetxdata(sizeof(Semaphore_Release), Semaphore_Release, 0);
                dwt_writetxfctrl(sizeof(Semaphore_Release), 0);

                dwt_starttx(DWT_START_TX_IMMEDIATE );
                while (!(dwt_read32bitreg(SYS_STATUS_ID) & SYS_STATUS_TXFRS))
                {};
            }
        }

        if(TAG_ID == MASTER_TAG)//master  tag
        {
            //statistics tag
            if(Sum_Tag_Semaphore_request() == 0)
            {
                for(tag_index = 0; tag_index <MAX_SLAVE_TAG; tag_index++)
                {
                    Tag_Statistics[ALL_MSG_SN_IDX] = frame_seq_nb;
                    Tag_Statistics[ALL_MSG_TAG_IDX] = tag_index;
                    dwt_writetxdata(sizeof(Tag_Statistics), Tag_Statistics, 0);
                    dwt_writetxfctrl(sizeof(Tag_Statistics), 0);
                    dwt_starttx(DWT_START_TX_IMMEDIATE | DWT_RESPONSE_EXPECTED);

                    while (!((status_reg = dwt_read32bitreg(SYS_STATUS_ID)) & (SYS_STATUS_RXFCG | SYS_STATUS_ALL_RX_ERR)))
                    { };

                    if (status_reg & SYS_STATUS_RXFCG)
                    {
                        /* Clear good RX frame event and TX frame sent in the DW1000 status register. */
                        dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_RXFCG | SYS_STATUS_TXFRS);
                        /* A frame has been received, read it into the local buffer. */
                        frame_len = dwt_read32bitreg(RX_FINFO_ID) & RX_FINFO_RXFLEN_MASK;
                        if (frame_len <= RX_BUF_LEN)
                        {
                            dwt_readrxdata(rx_buffer, frame_len, 0);
                        }
                        rx_buffer[ALL_MSG_SN_IDX] = 0;
						
                        if(rx_buffer[ALL_MSG_TAG_IDX] == tag_index)
                        {
                            uint8 temp = rx_buffer[ALL_MSG_TAG_IDX] ;
							rx_buffer[ALL_MSG_TAG_IDX] =0;
                            if (memcmp(rx_buffer, Tag_Statistics_response, ALL_MSG_COMMON_LEN) == 0)
                            {
                                Semaphore[temp] = 1;

                               GPIO_SetBits(GPIOA,GPIO_Pin_2);
                            }
                        }
                    }
                    else
                    {
                        /* Clear RX error events in the DW1000 status register. */
                        dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_ALL_RX_ERR);
                        //GPIO_SetBits(GPIOA,GPIO_Pin_1);
                    }
                }
            }
            //pick one tag ,send Semaphore message
            //release to specific tag(TAG ID)
            //master tag send release signal,and the specific tag send comfirm message
            if(Waiting_TAG_Release_Semaphore == 0 && Sum_Tag_Semaphore_request() != 0)
            {
          		Semaphore[0] = 0;
                for(tag_index = 0; tag_index <MAX_SLAVE_TAG; tag_index++)
                {
                    if(Semaphore[tag_index] == 1)
                    {
                       // dwt_setrxtimeout(0);
                        Master_Release_Semaphore[ALL_MSG_SN_IDX] = frame_seq_nb;
                        Master_Release_Semaphore[ALL_MSG_TAG_IDX] = tag_index;
                        dwt_writetxdata(sizeof(Master_Release_Semaphore), Master_Release_Semaphore, 0);
                        dwt_writetxfctrl(sizeof(Master_Release_Semaphore), 0);
                        dwt_starttx(DWT_START_TX_IMMEDIATE | DWT_RESPONSE_EXPECTED);
						
						dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_RXFCG | SYS_STATUS_TXFRS);

                        while (!((status_reg = dwt_read32bitreg(SYS_STATUS_ID)) & (SYS_STATUS_RXFCG | SYS_STATUS_ALL_RX_ERR)))
                        { };
						

                        if (status_reg & SYS_STATUS_RXFCG)
                        {

						    GPIO_SetBits(GPIOA,GPIO_Pin_1);
                            dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_RXFCG | SYS_STATUS_TXFRS);
                            frame_len = dwt_read32bitreg(RX_FINFO_ID) & RX_FINFO_RXFLEN_MASK;
                            if (frame_len <= RX_BUF_LEN)
                            {
                                dwt_readrxdata(rx_buffer, frame_len, 0);
                            }
                            rx_buffer[ALL_MSG_SN_IDX] = 0;
							
                            if(rx_buffer[ALL_MSG_TAG_IDX] == tag_index)
                            {
                                rx_buffer[ALL_MSG_TAG_IDX] = 0; GPIO_SetBits(GPIOA,GPIO_Pin_3);
								//USART_puts(rx_buffer,frame_len);
                                if (memcmp(rx_buffer, Master_Release_Semaphore_comfirm, ALL_MSG_COMMON_LEN) == 0)
                                {
                                    //if the tag recive a semaphore, wait release remaphore
                                    Waiting_TAG_Release_Semaphore ++;                                   
                                    continue;//only release one semphore once
                                }
                            }
							

